#! /usr/bin/env perl -w

use 5.014;
use strict;
use utf8;
use autodie;

open my $fhout, ">", "output.txt";
select $fhout;

say join("\t", "Серийный номер", "Тип", "Счетчик", "Адрес", "Дата", "Время",
"Ua, B", "Ub, B", "Uc, B", "Ia, A", "Ib, A", "Ic, A", "<AB", "<AC","<BC",
"PF", "PF A", "PF B", "PF C", "S, BA", "Sa, BA", "Sb, BA", "Sc, BA", "Q",
"Qa, BAp", "Qb, BAp", "Qc, BAp", "P, Вт", "Pa, Вт", "Pb, Вт", "Pc, Вт", "Ki" );
foreach my $file (@ARGV) {
	open (my $fh, "<:encoding(cp1251)", $file);
	read ($fh, $_, 10000000);
	while (m| 				# строим регэксп
			<TD>Угол.*фазами:</TD>.*\n.*<B> # углы между токами
			Ф1-Ф2\((?<ang1>.*)\),\s
			Ф1-Ф3\((?<ang2>.*)\),\s
			Ф2-Ф3\((?<ang3>.*)\)</B>.*\n.*\n.*\n
			<TD>Ток,\s.*\n.*		# фазные токи
			Ф1\((?<cur1>.*)\),\s
			Ф2\((?<cur2>.*)\),\s
			Ф3\((?<cur3>.*)\)</B>.*\n.*\n.*\n
			<TD>Напряжение,\s.*\n.*		# фазные напряжения
			Ф1\((?<v1>.*)\),\s
			Ф2\((?<v2>.*)\),\s
			Ф3\((?<v3>.*)\)</B>.*\n.*\n.*\n
			<TD>Коэффициент\sмощности.*\n.*	# косинус фи
			Сумма\((?<pfS>.*)\),\s
			Ф1\((?<pf1>.*)\),\s
			Ф2\((?<pf2>.*)\),\s
			Ф3\((?<pf3>.*)\)</B>.*\n.*\n.*\n
			<TD>Общая\sмощность.*\n.*	# полная мощность
			Сумма\((?<S>.*)\),\s
			Ф1\((?<S1>.*)\),\s
			Ф2\((?<S2>.*)\),\s
			Ф3\((?<S3>.*)\)</B>.*\n.*\n.*\n
			<TD>Реактивная\sмощность.*\n.*	# реактивная мощность
			Сумма\((?<Q>.*)\),\s
			Ф1\((?<Q1>.*)\),\s
			Ф2\((?<Q2>.*)\),\s
			Ф3\((?<Q3>.*)\)</B>.*\n.*\n.*\n
			<TD>Активная\sмощность.*\n.*	# активная мощность
			Сумма\((?<P>.*)\),\s
			Ф1\((?<P1>.*)\),\s
			Ф2\((?<P2>.*)\),\s
			Ф3\((?<P3>.*)\)</B>.*\n.*\n.*\n
			<TD>Время\sсчетчика.*\n.*	# время счетчика
			<TD><B>\w+,\s(?<date>
				\d\d\.\d\d.\d\d),\s
			(?<time>\d\d:\d\d:\d\d).*\n.*\n.*\n
			<TD>Коэффициенты\sтрансформации.*\n.* # коэфф. трансф.
			<B>(?<Ku>\d+)/(?<Ki>\d+)</B>.*\n.*\n.*\n
			<TD>Сетевой\sадрес:.*\n.*	# сетевой адрес
			<B>(?<netaddr>\d+).*\n.*\n.*\n
			.*\n.*\n.*\n.*\n		# дата изготовления
			<TD>Серийный\sномер:.*\n.*	# Серийный номер
			<B>(?<snum>\d+).*\n.*\n.*\n
			.*\n.*\n.*\n.*\n		# Описание
			<TD>Тип\sсчетчика:.*\n.*	# Тип счетчика
			<B>(?<type>.*)</B>.*\n.*\n.*\n
			<TD>Счетчик:.*\n.*		# Счетчик
			<B>(?<count>\d+).*\n.*\n.*\n

			|gx) {
		print join ("\t", $+{"snum"}, $+{"type"},  $+{"count"}, "");
		print join ("\t", $+{"netaddr"}, "");
		print join ("\t", $+{"date"}, $+{"time"}, "");
		print join ("\t", $+{"v1"}, $+{"v2"}, $+{"v3"}, "");
		print join ("\t", $+{"cur1"}, $+{"cur2"}, $+{"cur3"}, "");
		print join ("\t", $+{"ang1"}, $+{"ang2"}, $+{"ang3"}, "");
		print join ("\t", $+{"pfS"}, $+{"pf1"}, $+{"pf2"}, $+{"pf3"}, "");
		print join ("\t", $+{"S"}, $+{"S1"}, $+{"S2"}, $+{"S3"}, "");
		print join ("\t", $+{"Q"}, $+{"Q1"}, $+{"Q2"}, $+{"Q3"}, "");
		print join ("\t", $+{"P"}, $+{"P1"}, $+{"P2"}, $+{"P3"}, "");
		print join ("\t", $+{"Ki"}, "\n");
	}
	close $fh;
}
